Repository: autohotkey-docs-translation/v1-pt-br
Catalog: omegat/project_save.tmx
Source language: en
Languages: pt_br

source: A directory other than the default may be specified via the /D parameter (in the absence of /S, this changes the default directory displayed by the installer).
pt_br: Um diretório que não seja o padrão pode ser especificado pelo parâmetro /D (na ausência de /S, essa opção muda o diretório padrão exibido pelo instalador).

source: A function usually return a value differently than a command does.
pt_br: Uma função normalmente retorna um valor de forma diferente da forma que um comando retorna valores.

source: A hotkey is a key that is hot to the touch.
pt_br: Uma hotkey é uma tecla que queima o dedo quando você a aperta

source: A hotkey is created by using a single pair of colons.
pt_br: Uma hotkey é criada usando-se um único par do sinal de dois-pontos.

source: A hotstring has a pair of colons on each side of the text you want to trigger the text replacement.
pt_br: Uma hotstring tem um par de dois-pontos em cada lado do texto que você deseja substituir (a abreviatura).

source: A list of all commands and built-in functions can be found here.
pt_br: Uma lista de todos os comandos e funções nativas pode ser encontrada aqui.

source: A nice thing to know is that you can have many lines of code for each hotkey, hotstring, label, and a lot of other things we haven't talked about yet.
pt_br: Uma coisa legal de se saber é que você pode ter várias linhas de código para cada hotkey, para cada rótulo e para um bando de outras coisas de que não falamos ainda.

source: A number of useful variables are built into the program and can be referenced by any script.
pt_br: Há várias variáveis úteis que são nativas ao programa e que podem ser referenciadas por qualquer script.

source: A running script can usually be reloaded via its tray menu.
pt_br: Um script em execução normalmente pode ser recarregado por meio do menu da bandeja.

source: A script can do as little as performing a single action and then exiting, but most scripts define a number of hotkeys, with each hotkey followed by one or more actions to take when the hotkey is pressed.
pt_br: Um script pode fazer algo pequeno como executar uma ação simples e depois finalizar, mas a maioria dos scripts define um certo número de teclas de atalho (hotkeys, daqui para frente), com cada uma delas seguida de uma ou mais ações para executar quando a hotkey é pressionada.

source: A script is simply a plain text file with the .ahk filename extension containing instructions for the program, like a configuration file, but much more powerful.
pt_br: Um script é simplesmente um arquivo de texto plano, com a extensão .ahk no nome do arquivo, contendo instruções para o programa, como um arquivo de configuração, mas muito mais poderoso.

source: A script may create a new environment variable or change the contents of an existing one with EnvSet.
pt_br: Um script pode criar uma variável de ambiente ou alterar o conteúdo de uma com EnvSet.

source: A similar technique might work in other browsers:
pt_br: Uma técnica similar talvez funcione em outros navegadores:

source: A special thanks to Jonathan Bennett, whose generosity in releasing AutoIt v2 as free software in 1999 served as an inspiration and time-saver for myself and many others worldwide.
pt_br: Um obrigado especial a Jonathan Bennett, cuja generosidade em lançar o AutoIt v2 como software livre em 1999 serviu como uma inspiração e como um ganha-tempo para mim e outros ao redor do mundo.

source: A typical function looks like:
pt_br: Uma função típica tem a seguinte forma:

source: A variable allows you to use a name as a placeholder for a value.
pt_br: Uma variável permite que você use um nome como um marcador de posição de um valor.

source: A variable can be thought of as a container or storage location for a value, so you'll often find the documentation refers to a variable's value as the contents of the variable.
pt_br: Uma variável pode ser entendida como um contêiner ou local de armazenamento para um valor, então você muitas vezes vai ver que a documentação se refere ao valor da variável como o conteúdo da variável.

source: A variable has three main aspects:
pt_br: Uma variável tem três aspectos principais:

source: A variable name has scope, which defines where in the code that name can be used to refer to that particular variable; in other words, where the variable is visible.
pt_br: Uma variável tem um escopo, o qual define onde no código aquele nome pode ser usado para se referir àquela variável em particular; em outras palavras, onde a variável está visível.

source: A window should have popped up, probably Notepad.
pt_br: Uma janela deve abrir, provavelmente o Bloco de Notas.

source: A workaround is to ensure UIA scripts are loaded last.
pt_br: Uma solução de contorno é certificar-se que scripts UIA sejam carregados por último.

source: ALT+C":true,
pt_br: ALT+C":"Tecla de atalho: ALT+S",

source: ALT+N":true,
pt_br: ALT+N":"Tecla de atalho: ALT+I",

source: ALT+S":true,
pt_br: ALT+S":"Tecla de atalho: ALT+U",

source: ANSI 32-bit.
pt_br: ANSI 32 bits

source: ANSI versions of AutoHotkey use the system default ANSI code page, which depends on the system locale or "language for non-Unicode programs" system setting.
pt_br: Versões ANSI do AutoHotkey usam a página de código padrão ANSI, que depende da região do sistema ou a configuração “idioma para programas não Unicode” do sistema.

source: Acknowledgements
pt_br: Agradecimentos

source: Activate Notepad
pt_br: Ative a janela do Bloco de Notas

source: Additionally, for a list of all/most hotkey names that can be used on the left side of a hotkey's double-colon, see List of Keys, Mouse Buttons, and Joystick Controls.
pt_br: Mais que isso, para ver uma lista com todos/quase todos nomes de hotkeys que podem ser usadas no lado esquerdo do sinal duplo de dois-pontos da hotkey, veja Lista de Teclas, Botões do Mouse e Controle do Joystick (por enquanto em inglês).

source: Additionally, some special characters may need to be escaped or enclosed in braces, depending on the context.
pt_br: Ademais, alguns caracteres especiais podem exigir escape ou que sejam envoltos em chaves, dependendo do contexto.

source: Additionally, you cannot do math in the parameters, unlike functions.
pt_br: Ademais, nos comandos você não pode fazer operações matemáticas nos parâmetros, ao contrário das funções.

source: Advanced Buttons
pt_br: Botões Avançados

source: After copying the function into a script or saving it as SendSuppressedKeyUp.ahk in a function library, it can be used as follows:
pt_br: Depois de copiar a função para um script ou salvá-la como SendSuppressedKeyUp.ahk dentro de uma biblioteca de função, ela poderá ser usada assim:

source: After creating the default script, launch AutoHotkey via the shortcut in the Start menu to run it.
pt_br: Depois de criar o script padrão, execute o AutoHotkey por meio do atalho no Menu Iniciar para abri-lo.

source: After downloading it, you may possibly need to install it.
pt_br: Depois de fazer o download, você provavelmente terá que instalá-lo em seguida,

source: After editing a script, you must run or reload the script for the changes to take effect.
pt_br: Depois de editar um script, você deve carregar ou recarregar o script para que as mudanças tenham efeito.

source: After removing the keys it takes all higher numbered/integer keys and moves them down to fill the gap, so that if there was a value at Index + Length it will now be at Index.
pt_br: Depois de remover as chaves, ele tomará todas as chaves maiores remanescentes e as moverá para baixo para preencher a lacuna, de forma que, se havia um valor em Indice + Comprimento, ele ficará agora em Indice.

source: All in one big happy script file.
pt_br: Tudo em um único arquivo de script grande e feliz.

source: All you have to do is put your bracket notation on the left side of an expression assignment operator :=.
pt_br: Tudo o que você deve fazer é inserir seu código com notação de colchetes no lado esquerdo do operador de definição da expressão :=.

source: Allows you to remove a range of numbered/integer or string keys between FirstKey and LastKey.
pt_br: Permite que você remova um intervalo de chaves que sejam strings ou números/inteiros entre PrimeiraChave e UltimaChave.

source: Also note that Ahk2Exe saves settings to the following registry key:
pt_br: Também note que o Ahk2Exe salva as configurações na seguinte chave do registro:

source: Also note that the pressing of joystick buttons always "passes through" to the active window if that window is designed to detect the pressing of joystick buttons.
pt_br: Também note que pressionar os botões do joystick sempre “passa através” da janela ativa se essa janela for desenvolvida para detectar o pressionamento de botões do joystick.

source: Also refer to the following question:
pt_br: Também veja a seguinte pergunta:

source: Also, a hotkey that executes more than one line must list its first line beneath the hotkey, not on the same line.
pt_br: Do mesmo modo, uma hotkey que executa mais que uma linha deve ter sua primeira linha debaixo da hotkey, não na mesma linha.

source: Also, the built-in variable A_Now contains the current local time.
pt_br: A variável nativa A_Now também contém o horário local atual.

source: Also, the value 3 is stored in the object key "Price".
pt_br: Além disso, o valor 3 é armazenado na chave "Preco" do objeto.

source: Also, with the Send commands you are able to send more than one letter, number or symbol at a time.
pt_br: Outra coisa, com o comando Send você pode enviar mais do que uma letra, número ou símbolo ao mesmo tempo.

source: Alternatively, you can create a script file (something.ahk) anywhere you like, and run the script file instead of running AutoHotkey.
pt_br: Alternativamente, você pode criar um arquivo de script (algumacoisa.ahk) em qualquer lugar que você quiser, e executar o arquivo de script em vez de abrir o executável do AutoHotkey.

source: Although name or arg1 is considered to be the first parameter, remember that these are just messages, and the object is free to handle them in any way.
pt_br: Apesar de name ou arg1 serem considerados como o primeiro parâmetro, lembre-se que esses são somente mensagens, e o objeto está livre para manipulá-los de qualquer maneira.

source: Although AutoHotkey supports Unicode text, it is optimized for backward-compatibility, which means defaulting to the ANSI encoding rather than the more internationally recommended UTF-8.
pt_br: Apesar de o AutoHotkey suportar texto Unicode, ele é otimizado para retrocompatibilidade, o que significa usar a codificação ANSI em vez da internacionalmente recomendada UTF-8.

source: Although a variable name may consist entirely of digits, this is generally used only for incoming command line parameters.
pt_br: Embora uma variável possa consistir totalmente de algarismos, fazer isso geralmente só é usado para parâmetros de entrada da linha de comando.

source: Although a variable is typically thought of as holding a single value, and that value having a distinct type (string, number or object), AutoHotkey automatically converts between numbers and strings in cases like myString + 1 and MsgBox %myNumber%.
pt_br: Apesar de que tipicamente imagina-se uma variável armazenando um único valor, e também cada variável seja de um tipo distinto (string, número e objeto), o AutoHotkey automaticamente converte entre números e strings em casos como minhaString + 1 e MsgBox %meuNumero%.

source: Although any single character can be used as a key name, its meaning (scan code or virtual keycode) depends on the current keyboard layout.
pt_br: Apesar de qualquer caractere individual poder ser usado como nome de tecla, seu significado (código de leitura ou código virtual) depende do layout do teclado usado.

source: Although indentation makes code easier to read, in AutoHotkey it does not affect the grouping of statements.
pt_br: Conquanto a indentação deixa o código mais fácil de ler, no AutoHotkey ela não afeta o agrupamento de instruções.

source: Although it is certainly possible that the file has been infected, most often these alerts are false positives, meaning that the antivirus program is mistaken.
pt_br: Apesar de ser certamente possível que o arquivo tenha sido infectado, na maioria dos casos esses alertas são falsos positivos, o que significa que o programa de antivírus está equivocado.

source: Although it is present in Windows Vista and later, it is enabled by default on new systems or new installs, and it is more difficult to disable on Windows 8 and later.
pt_br: Apesar de ser um componente presente no Windows Vista e posteriores, ele é habilitado por padrão em sistemas novos ou novas instalações, e é mais difícil de desabilitar no Windows 8 e mais recentes.

source: Although larger values can be contained within a string, any attempt to convert the string to a number (such as by using it in a math operation) might yield inconsistent results.
pt_br: Apesar de valores maiores poderem ser contidos numa string, qualquer tentativa de converter a string em um número (como pelo uso da string numa operação matemática) pode gerar resultados inconsistentes.

source: Although the SetFormat command can be used to change the current format, it is usually better to use the Format function to format a string.
pt_br: Apesar de o comando SetFormat poder ser usado para alterar o formato atual, costuma ser melhor usar a função Format para formatar uma string.

source: Although the following Joystick control names cannot be used as hotkeys, they can be used with GetKeyState():
pt_br: Apesar de os nomes de controle de Joystick abaixo não poderem ser usados como hotkeys, eles podem ser usados com GetKeyState():

source: Although the program automatically initialises all variables (an empty string being the default value), it is good practice for a script to always initialise its variables before use.
pt_br: Apesar de o programa automaticamente inicializar todas as variáveis (uma string vazia sendo o valor padrão), é uma boa prática que o script sempre inicialize as variáveis antes do uso.

source: Although they can be used in a method definition, calling such a method requires using square brackets.
pt_br: Apesar de poderem ser usados na definição de um método, chamar um método desse exigirá o uso de colchetes.

source: Although we may say the variable myArray contains an array (which is a type of object), what the variable contains isn't the array itself but rather a reference or pointer to the array.
pt_br: Não obstante possamos dizer que a variável meuVetor contém um vetor (o que é um tipo de objeto), o que a variável contém não é o vetor em si mas uma referência ou ponteiro para o vetor.

source: An ampersand may be used between any two keys or mouse buttons to combine them into a custom hotkey.
pt_br: O símbolo “&” pode ser usado entre quaisquer duas teclas ou botões do mouse para combiná-los e formar uma hotkey personalizada.

source: An associative array is a collection of data where each item has a name.
pt_br: Um vetor associativo é uma coleção de dados na qual cada item tem um nome.

source: An embedded script can be specified on the command line or with #Include by writing an asterisk (*) followed by the resource name.
pt_br: Um script incorporado pode ser especificado na linha de comando ou com #Include inserindo-se um asterisco (*) seguido do nome do recurso.

source: An example showing what shouldn't be done to a hotkey:
pt_br: Um exemplo mostrando o que não deve ser feito com uma hotkey:

source: An indexed array is an object representing a list of items, numbered 1 and up.
pt_br: Um vetor indexado é um objeto representando uma lista de itens numerados de 1 em diante.

source: An object can represent a thing, a service, or something else, and can provide ways for the script to interact with this thing or service.
pt_br: Um objeto pode representar uma coisa, um serviço, ou alguma outra coisa, e pode proporcionar maneiras de o script interagir com essa coisa ou serviço.

source: An object contains a group of values, allowing the group itself to be treated as one value.
pt_br: Um objeto contém um grupo de valores, permitindo que o grupo em si seja tratado como um valor.

source: An object is basically a collection of variables.
pt_br: Um objeto é basicamente uma coleção de variáveis.

source: An object is deleted only after all references have been released; you cannot delete an object explicitly, and should not try.
pt_br: Um objeto só é excluído depois que todas as referências a ele são liberadas; você não pode excluir um objeto explicitamente, e não deve tentar fazê-lo.

source: And the content needs to go below, followed by a return.
pt_br: E o conteúdo deve vir embaixo, seguido de um return.

source: And while you wait for help, you can try learning and doing it yourself.
pt_br: E, enquanto você espera pela ajuda, você pode ir tentando e aprendendo sozinho.

source: Another common issue is that people think that everything needs to be wrapped in brackets with the Send command.
pt_br: Outro problema comum é que as pessoas pensam que tudo deve ser envolto em chaves com o comando Send.

source: Another strategy is to always convert to string (thereby applying rounding) before comparison.
pt_br: Outra estratégia é sempre converter para string (logo, aplicando o arredondamento) antes da comparação.

source: Any advice?
pt_br: Algum conselho?

source: Any lines you want to execute immediately when the script starts should appear at the top of the script, prior to the first hotkey, hotstring, or Return.
pt_br: Quaisquer linhas que você quiser que sejam executadas imediatamente quando o script inicia devem vir no começo do script, antes da primeira hotkey, hotstring ou Return.

source: Any number of variables can contain a reference to the same object.
pt_br: Qualquer número de variáveis pode conter uma referência para o mesmo objeto.

source: Any other resource
pt_br: Qualquer outra fonte

source: Any text needs to be in quotes.
pt_br: Qualquer texto que vier terá que vir entre aspas.

source: Anything inside of these brackets are OPTIONAL.
pt_br: Tudo o que estiver dentro desses colchetes é OPCIONAL.

source: Anything to the left of :: are the keys you need to press.
pt_br: Tudo à esquerda de :: são as teclas que você deve pressionar.

source: Apples are a fruit.
pt_br: Maçãs são frutas.

source: Array function
pt_br: Função vetorial

source: As a hotkey (Alt::) it fires upon release unless it has the tilde prefix.
pt_br: Como hotkey (Alt::), a tecla Alt só é enviada no momento em que é solta a não ser que esteja acompanhada do prefixo ~ (til).

source: As a hotkey (Control::) it fires upon release unless it has the tilde prefix.
pt_br: Como hotkey (Control::), a tecla Ctrl só é enviada no momento em que é solta a não ser que esteja acompanhada do prefixo ~ (til).

source: As a hotkey (Shift::) it fires upon release unless it has the tilde prefix.
pt_br: Como hotkey (Shift::), a tecla Shift só é enviada no momento em que é solta a não ser que esteja acompanhada do prefixo ~ (til).

source: As capital letters are produced by sending Shift, A produces a different effect in some programs than a.
pt_br: Tendo em vista que as letras maiúsculas são produzidas mediante o envio da tecla Shift, A produz um efeito diferente de a em alguns programas.

source: As stated above, functions are different because they use parentheses.
pt_br: Como dito acima, funções são diferentes porque elas usam parênteses.

source: As the default AutoHotkey installation does not include a compressor, compiled scripts are not compressed by default.
pt_br: Já que a instalação padrão do AutoHotkey não inclui um compressor, scripts compilados não são comprimidos por padrão.

source: As the following characters may be reserved for other purposes in AutoHotkey v2, it is recommended to avoid using them:
pt_br: E, dado que os caracteres a seguir poderão estar reservados para outros fins na versão 2 do AutoHotkey, recomenda-se evitá-los:

source: As these conversions can happen very frequently, whenever a variable is converted, the result is cached in the variable.
pt_br: Já que essas conversões podem ocorrer muito frequentemente, toda vez que uma variável é convertida, o resultado é armazenado no cache da variável.

source: As with other commands, the comma in front of the first parameter is optional.
pt_br: Tal como em outros comandos, a vírgula na frente do primeiro parâmetro é opcional.

source: Asking for Help
pt_br: Pedindo ajuda

source: AutoHotkey Beginner Tutorial by tidbit
pt_br: Tutorial para iniciantes, por tidbit

source: AutoHotkey does not have a specific boolean type, so it uses the integer value 0 to represent false and 1 to represent true.
pt_br: O AutoHotkey não tem um tipo específico de valor booleano, então ele usa o valor inteiro 0 para representar falso e 1 para representar verdadeiro.

source: AutoHotkey does not have a value which uniquely represents nothing, null, nil or undefined, as seen in other languages.
pt_br: O AutoHotkey não possui um valor próprio para representar nothing, null, nil ou undefined, como visto em outras linguagens.

source: AutoHotkey doesn't do anything on its own; it needs a script to tell it what to do.
pt_br: o AutoHotkey não faz nada por si só; ele precisa de um script para dizer-lhe o que fazer.

source: AutoHotkey has the ability to have as many hotkeys and hotstrings in one file as you want.
pt_br: O AutoHotkey permite que você adicione o número que você quiser de hotkeys e hotstrings.

source: AutoHotkey has two main types of things used by the scripter to create code:
pt_br: O AutoHotkey tem dois grandes tipos de expedientes que são usados pelo usuário para criar código:

source: AutoHotkey is not magic, we all wish it was, but it is not.
pt_br: O AHK não é mágica; nós todos queríamos que fosse, mas não é.

source: AutoHotkey primarily uses two data types for pure numbers:
pt_br: O AutoHotkey primariamente usa dois tipos de dados para números puros:

source: AutoHotkey supports these number formats:
pt_br: O AutoHotkey suporta estes formatos de números:

source: AutoHotkey supports these types of values:
pt_br: O AutoHotkey suporta estes tipos de valores:

source: AutoHotkey uses the same set of rules for naming various things, including variables, functions, window groups, GUIs, classes and methods:
pt_br: AutoHotkey usa o mesmo conjunto de regras para denominar várias coisas, inclusive variáveis, funções, grupos de janelas, GUIs, classes e métodos:

source: AutoHotkey will not automatically recognize a UTF-8 file unless it begins with a byte order mark.
pt_br: O AutoHotkey não irá reconhecer um arquivo UTF-8 automaticamente a não ser que ele inicie com uma marca de ordem de bytes (BOM — Byte Order Mark).

source: AutoHotkey's installer comes packaged as a 7-zip self-extracting archive which attempts to extract to the user's Temp directory and execute a compiled script.
pt_br: O instalador do AutoHotkey vem empacotado em um arquivo 7-zip que se extrai automaticamente e que tenta extrair o conteúdo para o diretório Temp do usuário e executar um script compilado.

source: Back
pt_br: Voltar

source: Backspace (or BS)
pt_br: Backspace (ou BS)

source: Banana := Object("Color", "Yellow", "Taste", "Delicious", "Price", 3)
pt_br: Banana := Object("Cor", "Amarelo", "Gosto", "Delicioso", "Preco", 3)

source: Banana := {"Color":
pt_br: Banana := {"Cor":

source: Banana.Consistency := ""
pt_br: Banana.Consistência := ""

source: Banana.Consistency := "Mushy"
pt_br: Banana.Consistência := "Molenga"

source: Banana["Pickled"] := True
pt_br: Banana["Em conserva"] := True

source: Basically:
pt_br: Basicamente:

source: Be kind.
pt_br: Seja simpático.

source: Be open.
pt_br: Seja aberto.
